# Дана строка-предложение на английском языке. Преобразовать строку так,
# чтобы каждое слово начиналось с заглавной буквы.
print('Введите предложение на английском языке:')
print(input().title())
